'''
퀵정렬(0(nlogn))이지만 worst에는 (0(n**2)
분할, 정복
피벗

입력값 = [66, 77, 54, 32, 10, 5, 11, 15]

[66, 77, 54, 32, 10, 5, 11, 15]
[54, 32, 10, 5, 11, 15] + [66] + [77]
[32, 10, 5, 11, 15] + [54] + [66] + [77]
[10, 5, 11, 15] + [32] + [54] + [66] + [77]
[5] + [10] + [11, 15] + [32] + [54] + [66] + [77]
[5] + [10] + [11] + [15] + [32] + [54] + [66] + [77]
'''

g_list = []

def 퀵정렬(입력리스트):
    입력리스트의길이 = len(입력리스트)
    if 입력리스트의길이 <= 1:
        return 입력리스트
    피벗값 = 입력리스트.pop(0)
    그룹_하나 = []
    그룹_둘 = []
    for i in range(입력리스트의길이-1):
        if 입력리스트[i] < 피벗값:
            그룹_하나.append(입력리스트[i])
        else:
            그룹_둘.append(입력리스트[i])
    result = '그룹_하나 : {}, 피벗 : {}, 그룹_둘 : {}'.format(그룹_하나, 피벗값, 그룹_둘)
    g_list.append(result)
    return 퀵정렬(그룹_하나) + [피벗값] + 퀵정렬(그룹_둘)

입력값 = [66, 77, 54, 32, 10, 5, 11, 15]
print(퀵정렬(입력값))
for i in g_list:
    print(i)